# Parameters
nc: 2  # number of classes
depth_multiple: 1.33 
width_multiple: 1.25
anchors: 3
#  7,6, 12,10, 23,11, 17,18, 32,17, 26,31, 52,27, 38,47, 78,40, 56,75, 118,88, 129,171
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 1, SELayer, [256, 4]], #4
   [-1, 6, C3, [256]], # 5
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16
   [-1, 1, SELayer, [512, 4]], # 7
   [-1, 9, C3, [512]], # 8
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 1, SELayer, [1024, 4]], #10
   [-1, 3, C3, [1024]], # 11
   [-1, 1, SPPF, [1024, 5]],  # 12
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]], # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 1, C3, [128, False]],  # 24 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 21], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256, False]],  # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 30 (P4/16-medium)

   [[24, 27, 30], 1, Detect, [nc, anchors]],
  ]
